[{
	"title": "1984",
	"author": "George Orwell",
	"bookUrl": "images/book-cover-images/1984-1536x2028.jpg",
	"description": "View our feature on George Orwells 1984. Written in 1948, 1984 was George Orwell’s chilling prophecy about the future."
}, {
	"title": "All The Birds, Singing",
	"author": "Evie Wyld",
	"bookUrl": "images/book-cover-images/allthebirdssinging-1536x2320.jpg",
	"description": "Jake Whyte has retreated to a remote farmhouse on a craggy British island, a place of ceaseless rains and battering winds, with only her collie and a flock of sheep as companions."
}, {
	"title": "An Object Of Beauty",
	"author": "Steve Martin",
	"bookUrl": "images/book-cover-images/anobjectofbeatury-1536x2273.jpg",
	"description": "Lacey Yeager is young, captivating, and ambitious enough to take the NYC art world by storm. Groomed at Sothebys and hungry to keep climbing the social and career ladders put before her, Lacey charms men and women, old and young, rich and even richer with her magnetic charisma and liveliness. Her ascension to the highest tiers of the city parallel the soaring heights--and, at times, the dark lows--of the art world and the country from the late 1990s through today."
}, {
	"title": "Area X",
	"author": "Jeff VanderMeer",
	"bookUrl": "images/book-cover-images/areax-1536x2043.jpg",
	"description": "Area X-a remote and lush terrain-has been cut off from the rest of the continent for decades. Nature has reclaimed the last vestiges of human civilization. The first expedition returned with reports of a pristine, Edenic landscape; all the members of the second expedition committed suicide; the third expedition died in a hail of gunfire as its members turned on one another; the members of the eleventh expedition returned as shadows of their former selves, and within months of their return, all had died of aggressive cancer. This is the twelfth expedition."
}, {
	"title": "Bad Teeth",
	"author": "Justin Long",
	"bookUrl": "images/book-cover-images/Bad-Teeth-Dustin-Long-1536x2302.jpg",
	"description": "Four interlocking narratives set in four American cities form a richly comic feast about love, academia, an elusive Tibetan novelist—and SOFA, a protest group so mysterious its very initials are open to interpretation.<br>Bad Teeth follows a cast of young literary men and women, each in a period of formation, in four very American cities—Brooklyn, Bloomington, Berkeley, and Bakersfield. A Pynchonesque treat, it’s four or more books in one: a bohemian satire, a campus comedy, a stoner’s reverie, and a quadruple love story. The plots coalesce around the search for a mysterious author, Jigme Drolma the Tibetan David Foster Wallace, who might in fact be a plagiarist. But how does the self-styled arch-magician Nicholas Bendix figure into this? What will happen when SOFA unleashes the Apocalypse? And whats to become of Lump, the cat?'"
}, {
	"title": "The Book Of Dead Philosophers",
	"author": "Simon Critchley",
	"bookUrl": "images/book-cover-images/book-of-dead-philosophers-1536x2760.png",
	"description": "In this collection of brief lives (and deaths) of nearly two hundred of the worlds greatest thinkers, noted philosopher Simon Critchley creates a register of mortality that is tragic, amusing, absurd, and exemplary. From the self-mocking haikus of Zen masters on their deathbeds to the last words of Christian saints and modern-day sages, this irresistible book contains much to inspire both amusement and reflection. Informed by Critchleys acute insight, scholarly intelligence, and sprightly wit, each entry tells its own tale, but collected together they add up to a profound and moving investigation of meaning and the possibility of happiness for us all."
}, {
	"title": "Breathing Room",
	"author": "Peter Davison",
	"bookUrl": "images/book-cover-images/breathingroom-1536x2233.jpg",
	"description": "The poems in Peter Davisons exuberant new collection contemplate the paradox of growing old--of having a mind still a juicy swamp of invention in a body beginning to falter. Both intimate and generous, these poems celebrate the cycle of the seasons, of death and rebirth: snapping turtles lay their eggs and new ones hatch;  a ruffed grouse drums his spring mating dance. Memory is central: a mothers lost face; a fathers voice that plumbed the marrow of poetry as tenderly as if a darling had crept into his arms; a wifes rueful eyes, cornflower blue. And the poet pays tribute to the literary life--to reading, to the precise moment a word rises to consciousness, to getting over Robert Frost, to the mind of Sylvia Plath. These are poems that expand time for us and deepen place, whether Davison is taking us on a path along a limestone cliff under canopies of holly and ivy, or is revisiting the instant while recovering from surgery when it becomes clear he is going to heal. Breathing Room gives us a splendid array of poems that we want to read with all our senses."
}, {
	"title": "Burn This Book",
	"author": "Toni Morrison (ed.)",
	"bookUrl": "images/book-cover-images/burn-this-book-1536x2306.jpg",
	"description": "As Americans we often take our freedom of speech for granted. When we talk about censorship we talk about China, the former Soviet Union, or the Middle East. But recent political developments—including the passage of the Patriot Act—have shined a spotlight on profound acts of censorship in our own backyard. Burn This Book features a sterling roster of award-winning writers offering their incisive, uncensored views on this most essential topic, including such revered literary heavyweights as Toni Morrison, Salman Rushdie, Orhan Pamuk, David Grossman, and Nadine Gordimer, among others. Both provocative and timely, Burn This Book is certain to inspire strong opinions and ignite spirited, serious dialogue."
}, {
	"title": "Columbine",
	"author": "Dave Cullen",
	"bookUrl": "images/book-cover-images/columbine-1536x2370.jpg",
	"description": "The tragedies keep coming. As we reel from the latest horror. So begins a new epilogue, illustrating how Columbine became the template for nearly two decades of spectacle murders. It is a false script, seized upon by a generation of new killers. In the wake of Newtown, Aurora, and Virginia Tech, the imperative to understand the crime that sparked this plague grows more urgent every year. What really happened April 20, 1999? The horror left an indelible stamp on the American psyche, but most of what we know is wrong. It wasnt about jocks, Goths, or the Trench Coat Mafia. Dave Cullen was one of the first reporters on scene, and spent ten years on this book-widely recognized as the definitive account. With a keen investigative eye and psychological acumen, he draws on mountains of evidence, insight from the worlds leading forensic psychologists, and the killers own words and drawings-several reproduced in a new appendix. Cullen paints raw portraits of two polar opposite killers. They contrast starkly with the flashes of resilience and redemption among the survivors."
}, {
	"title": "The Curious Incident Of The Dog In The Night-time",
	"author": "Mark Hadden",
	"bookUrl": "images/book-cover-images/curious-incident-of-the-dog-1536x2358.png",
	"description": "Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. Although gifted with a superbly logical brain, Christopher is autistic. Everyday interactions and admonishments have little meaning for him. Routine, order and predictability shelter him from the messy, wider world. Then, at fifteen, Christophers carefully constructed world falls apart when he finds his neighbors dog, Wellington, impaled on a garden fork, and he is initially blamed for the killing. Christopher decides that he will track down the real killer and turns to his favorite fictional character, the impeccably logical Sherlock Holmes, for inspiration. But the investigation leads him down some unexpected paths and ultimately brings him face to face with the dissolution of his parents marriage. As he tries to deal with the crisis within his own family, we are drawn into the workings of Christophers mind."
}, {
	"title": "David Lynch",
	"author": "David Lynch",
	"bookUrl": "images/book-cover-images/davidlynch.jpg",
	"description": "David Lynch erupted onto the cinema landscape in 1977 with Eraserhead, establishing himself as one of the most original and imaginative directors at work in contemporary cinema. Over the course of his career, he has remained true to a vision of the innocent lost in darkness and confusion, balancing hallucination and surrealism with a sense of Americana that is as pure and simple as his compelling storylines. In this volume, Lynch speaks openly about his films as well as about his lifelong commitment to painting, his work in photography, his television projects, and his musical collaborations with Angelo Badalamenti."
}, {
	"title": "December",
	"author": "Elizabeth Hartley Winthrop",
	"bookUrl": "images/book-cover-images/december-1536x2203.jpg",
	"description": "Centered on a young girl who inexplicably stops speaking, December is a riveting and insightful portrait of a family in crisis. Nine months after eleven-year-old Isabelle suddenly fell silent, her parents, Wilson and Ruth, are at their wits end. And what began as self-protection has spiraled beyond Isabelles control; she has become trapped in her silence, horrified by the pain she is causing and terrified of losing her old self to this cold young girl she barely recognizes. Isabelle must confront her overwhelming anger and love for her family, a cast of charming yet dangerous characters, and her own fears, before finally finding her voice."
}, {
	"title": "Dept. Of Speculation",
	"author": "Jenny Offill",
	"bookUrl": "images/book-cover-images/deptofspeculation-1536x2357.jpg",
	"description": "In the beginning, it was easy to imagine their future. They were young and giddy, sure of themselves and of their love for each other. Dept. of Speculation was their code name for all the thrilling uncertainties that lay ahead. Then they got married, had a child and navigated the familiar calamities of family life—a colicky baby, a faltering relationship, stalled ambitions. When their marriage reaches a sudden breaking point, the wife tries to retrace the steps that have led them to this place, invoking everything from Kafka to the Stoics to doomed Russian cosmonauts as she analyzes what is lost and what remains. In language that shimmers with rage and longing and wit, Offill has created a brilliantly suspenseful love story—a novel to read in one sitting, even as its piercing meditations linger long after the last page."
}, {
	"title": "Devil In The Details: Scenes From An Obsessive Girlhood",
	"author": "Jennifer Traig",
	"bookUrl": "images/book-cover-images/devilinthedetails-1060x1590.jpg",
	"description": "Recalling the agony of growing up as an obsessive-compulsive religious fanatic, Traig fearlessly confesses the most peculiar behaviour - like scrubbing her hands for a full half-hour before meals, feeding her stuffed animals before herself, and washing everything she owned because she thought it was contaminated by pork fumes!"
}, {
	"title": "Dracula",
	"author": "Bram Stoker",
	"bookUrl": "images/book-cover-images/draculabramstoker-1536x2369.jpg",
	"description": "Long before Dark Shadows or Twilight there was Bram Stokers classic novel about a bloodthirsty vampire and his search for new blood--Dracula is perhaps the most famous vampire story of all time.'),('Dyna-Mite', 'Various Authors', 'images/book-cover-images/dyna_mite.png', 'This book is a book about dynamite!"
}, {
	"title": "Dyna-Mite",
	"author": "Various",
	"bookUrl": "images/book-cover-images/dyna_mite.png",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "Elsewhere; A Curated Lifestyle",
	"author": "Various",
	"bookUrl": "images/book-cover-images/elsewhere.png",
	"description": "July 1940. 11 year-old Lydia walks through a village in rural Suffolk on a baking hot day. She is wearing a gas mask. The shops and houses are empty, windows boarded up and sandbags green with mildew, the village seemingly deserted. Leaving it behind, she strikes off down a country lane through the salt marshes to a large Edwardian house - the house she grew up in. Lydia finds it empty too, the windows covered in black-out blinds. Her family are gone."
}, {
	"title": "The End Of Food",
	"author": "Paul Roberts",
	"bookUrl": "images/book-cover-images/endoffood-1536x2311.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "An Ethics Of Interrogation",
	"author": "Michael Skerker",
	"bookUrl": "images/book-cover-images/ethics-of-interrogation-1536x2291.png",
	"description": "The act of interrogation, and the debate over its use, pervades our culture, whether through fictionalized depictions in movies and television or discussions of real-life interrogations on the news. But despite daily mentions of the practice in the media, there is a lack of informed commentary on its moral implications. Moving beyond the narrow focus on torture that has characterized most work on the subject, An Ethics of Interrogation is the first book to fully address this complex issue."
}, {
	"title": "Euphoria",
	"author": "Lily King",
	"bookUrl": "images/book-cover-images/euphoria-1536x2304.jpg",
	"description": "Euphoria is Lily Kings nationally bestselling breakout novel of three young, gifted anthropologists of the 30s caught in a passionate love triangle that threatens their bonds, their careers, and, ultimately, their lives. Inspired by events in the life of revolutionary anthropologist Margaret Mead, Euphoria is dazzling ... suspenseful ... brilliant...an exhilarating novel. —Boston Globe"
}, {
	"title": "Everything Leads To You",
	"author": "Nina Lacour",
	"bookUrl": "images/book-cover-images/everythinglleadstoyou-1536x2317.jpg",
	"description": "After being entrusted with her brothers Los Angeles apartment for the summer as a graduation gift, Emi Price isnt sure how to fulfill his one condition: that something great take place there while hes gone. Emi may be a talented young production designer, already beginning to thrive in the competitive film industry, but she still feels like an average teen, floundering when it comes to romance. But when she and her best friend, Charlotte, discover a mysterious letter at the estate sale of a Hollywood film legend, Emi must move beyond the walls of her carefully crafted world to chase down the loose ends of a movie icons hidden life, leading her to uncover a decades old secret and the potential for something truly epic: love."
}, {
	"title": "Everything That Makes You",
	"author": "Moriah McStay",
	"bookUrl": "images/book-cover-images/everythingthatmakesyou-1536x2316.jpg",
	"description": "Fiona Doyles face was horribly scarred as a child. She writes about her frustrations and dreams in notebooks, penning song lyrics—but she would never be brave enough to sing those songs in public or to Trent, the boy shes always loved. Fi Doyle never had an accident. Shes the best lacrosse player in the state and cant be distracted by her bff, Trent, who wants to be more than that. Then one day, her luck on the field goes south, and everythings not so easy anymore. Alternating chapters between Fiona and Fi tell two separate stories about the same girl and feature many of the same characters. Its fun to see how the characters change between the two stories, and how Fiona and Fi are alike and different."
}, {
	"title": "Fight Club",
	"author": "Chuck Palahniuk",
	"bookUrl": "images/book-cover-images/fight-club.jpg",
	"description": "The first rule about fight club is you dont talk about fight club. In his debut novel, Chuck Palahniuk showed himself to be his generations most visionary satirist. Fight Clubs estranged narrator leaves his lackluster job when he comes under the thrall of Tyler Durden, an enigmatic young man who holds secret boxing matches in the basement of bars. There two men fight as long as they have to. A gloriously original work that exposes what is at the core of our modern world."
}, {
	"title": "The Early Years",
	"author": "Gabriel Garcia Marquez",
	"bookUrl": "images/book-cover-images/gabriel_garcia_marquez.large_-1060x1609.jpg",
	"description": "In their youth, Florentino Ariza and Fermina Daza fall passionately in love. When Fermina eventually chooses to marry a wealthy, well-born doctor, Florentino is devastated, but he is a romantic. As he rises in his business career he whiles away the years in 622 affairs--yet he reserves his heart for Fermina. Her husband dies at last, and Florentino purposefully attends the funeral. Fifty years, nine months, and four days after he first declared his love for Fermina, he will do so again."
}, {
	"title": "A General Theory Of Love",
	"author": "Lewis, Amini, Lannon",
	"bookUrl": "images/book-cover-images/general-theory-of-love-1536x2368.jpg",
	"description": "A General Theory of Love demonstrates that our nervous systems are not self-contained: from earliest childhood, our brains actually link with those of the people close to us, in a silent rhythm that alters the very structure of our brains, establishes life-long emotional patterns, and makes us, in large part, who we are. Explaining how relationships function, how parents shape their childs developing self, how psychotherapy really works, and how our society dangerously flouts essential emotional laws, this is a work of rare passion and eloquence that will forever change the way you think about human intimacy."
}, {
	"title": "The Great Gatsby",
	"author": "F. Scott Fitzgerald",
	"bookUrl": "images/book-cover-images/great-gatsby.jpg",
	"description": "The Great Gatsby, F. Scott Fitzgeralds third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted gin was the national drink and sex the national obsession, it is an exquisitely crafted tale of America in the 1920s. The Great Gatsby is one of the great classics of twentieth-century literature."
}, {
	"title": "How The Light Gets In",
	"author": "Pat Schneider",
	"bookUrl": "images/book-cover-images/howthelight-1536x2304.jpg",
	"description": "When I begin to write, I open myself and wait. And when I turn toward an inner spiritual awareness, I open myself and wait. With that insight, Pat Schneider invites readers to contemplate their lives and deepest questions through writing. In seventeen concise thematic chapters that include meditations on topics such as fear, freedom, tradition in writing and in religions, forgiveness, joy, social justice, and death, How the Light Gets In gracefully guides readers through the artistic and spiritual questions that life offers to everyone."
}, {
	"title": "How To Drink",
	"author": "Victoria Moore",
	"bookUrl": "images/book-cover-images/howtodrink-1536x2051.jpg",
	"description": "We all know how to drink. Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle."
}, {
	"title": "How To Grow The Peanut",
	"author": "George Washington Carver",
	"bookUrl": "images/book-cover-images/howtogrowthepeanut-1536x2313.jpg",
	"description": "Peanuts are fairly unique in the nut world, as they grow underground and are not produced by large trees. That’s because they are not actually nuts at all, but legumes like beans or peas."
}, {
	"title": "Inside Out And Back Again",
	"author": "Thanhha Lai",
	"bookUrl": "images/book-cover-images/insideoutandbackagain-1060x1598.jpg",
	"description": "Inside Out and Back Again is a New York Times bestseller, a Newbery Honor Book, and a winner of the National Book Award! Inspired by the authors childhood experience of fleeing Vietnam after the Fall of Saigon and immigrating to Alabama, this coming-of-age debut novel told in verse has been celebrated for its touching childs-eye view of family and immigration. Hà has only ever known Saigon: the thrills of its markets, the joy of its traditions, and the warmth of her friends close by. But now the Vietnam War has reached her home. Hà and her family are forced to flee as Saigon falls, and they board a ship headed toward hope—toward America."
}, {
	"title": "Isaac's Style Book",
	"author": "Various",
	"bookUrl": "images/book-cover-images/isaacstylebook-1536x1975.jpg",
	"description": "'A twenty-year veteran of the fashion industry, Isaac Mizrahi has become a unique icon in the world of style. He doesnt do makeovers or take pleasure in berating the way a woman dresses. Instead, he is a problem solver—and a titan of trendsetting who believes that fashion should be seriously fun. Showcasing his singular approach to looking great, How to Have Style begins with the premise that all women should wear what inspires them. Using twelve real women facing real wardrobe dilemmas, Mizrahi walks readers through the fundamentals of finding a personal style that reflects their authentic selves."
}, {
	"title": "Jaws",
	"author": "Peter Benchley",
	"bookUrl": "images/book-cover-images/jaws-1536x2161.jpg",
	"description": "When Peter Benchley wrote Jaws in the early 1970s, he meticulously researched all available data about shark behavior. Over the ensuing decades, Benchley was actively engaged with scientists and filmmakers on expeditions around the world as they expanded their knowledge of sharks. Also during this time, there was an unprecedented upswing in the number of sharks killed to make shark-fin soup, and Benchley worked with governments and nonprofits to sound the alarm for shark conservation. He encouraged each new generation of Jaws fans to enjoy his riveting tale and to channel their excitement into support and protection of these magnificent, prehistoric apex predators."
}, {
	"title": "Viagem Ao Centro Da Terra",
	"author": "Julio Verne",
	"bookUrl": "images/book-cover-images/juliovernes-1060x1625.jpg",
	"description": "Axel está prestes a viver a aventura da sua vida, ainda que a contragosto. Obrigado pelo tio a acompanhá-lo numa expedição ao centro do planeta, o jovem e perspicaz narrador diverte o leitor com o seu bem-humorado relato da jornada, angustiado diante das excentricidades do genial professor Lidenbrock e do seu impassível guia."
}, {
	"title": "Little Red Riding Hood",
	"author": "Trina Schart Hyman",
	"bookUrl": "images/book-cover-images/littleredridinghood-1536x1055.jpg",
	"description": "In this beloved tale, Little Red Riding Hood is uneasy when her grandmother looks suspiciously like a sly wolf that she met along the way. Children will eagerly continue reading to see what will happen when the wolf shows how big and sharp his teeth are!"
}, {
	"title": "Loneliness",
	"author": "Cacioppo and Patrick",
	"bookUrl": "images/book-cover-images/loneliness_4327-1536x2311.jpg",
	"description": "John T. Cacioppos groundbreaking research topples one of the pillars of modern medicine and psychology: the focus on the individual as the unit of inquiry. By employing brain scans, monitoring blood pressure, and analyzing immune function, he demonstrates the overpowering influence of social context—a factor so strong that it can alter DNA replication. He defines an unrecognized syndrome—chronic loneliness—brings it out of the shadow of its cousin depression, and shows how this subjective sense of social isolation uniquely disrupts our perceptions, behavior, and physiology, becoming a trap that not only reinforces isolation but can also lead to early death. He gives the lie to the Hobbesian view of human nature as a war of all against all, and he shows how social cooperation is, in fact, humanity’s defining characteristic. Most important, he shows how we can break the trap of isolation for our benefit both as individuals and as a society."
}, {
	"title": "Making The Climb",
	"author": "John C. Bowling",
	"bookUrl": "images/book-cover-images/makingtheclimb-1536x2212.jpg",
	"description": "God has redefined the world of mangaement for the Christian leader through scripture. He isnt focused on bottom lines, demographics, or profit margins; Christ presents the paradox of eing a leader and a servant at the same time. In Grace-full Leadership, Bowling explores the leadership qualities and practices taht are distinct within the commnity of Christian leadership. Discover, when managing first as a Christian and second as a leader, how your company or organization can grow exponentially in spiritual gains--an eternity of difference in todays captial gains."
}, {
	"title": "Middle C",
	"author": "William H. Glass",
	"bookUrl": "images/book-cover-images/middlec-1536x2273-1.jpg",
	"description": "It begins in Graz, Austria, in 1938, when Joseph Skizzens father pretends to be Jewish and emigrates to avoid the Nazis. In London with his wife and children for the duration of the war, he mysteriously disappears and the rest of the family relocates to a small town in Ohio. Here Joseph Skizzen grows up and leads a resolutely ordinary life, but one that is built on a scaffold of forgery and deceit. Outwardly he is a professor of music at a mediocre college; secretly he is the earnestly obsessive curator of a private Inhumanity Museum, meant to contain the guilt of centuries of atrocities. Middle C tells the story of his journey—a story that is also an investigation into the nature of identity and the ways in which each of us is several selves."
}, {
	"title": "Never Let Me Go",
	"author": "Kazuo Ishiguro",
	"bookUrl": "images/book-cover-images/never-let-me-go.jpg",
	"description": "From the Booker Prize-winning author of The Remains of the Day comes a devastating new novel of innocence, knowledge, and loss. As children Kathy, Ruth, and Tommy were students at Hailsham, an exclusive boarding school secluded in the English countryside. It was a place of mercurial cliques and mysterious rules where teachers were constantly reminding their charges of how special they were. Now, years later, Kathy is a young woman. Ruth and Tommy have reentered her life. And for the first time she is beginning to look back at their shared past and understand just what it is that makes them special–and how that gift will shape the rest of their time together. Suspenseful, moving, beautifully atmospheric, Never Let Me Go is another classic by the author of The Remains of the Day."
}, {
	"title": "Nobody Is Ever Missing",
	"author": "Catherine Lacey",
	"bookUrl": "images/book-cover-images/nobodyisevermissing-1536x2313.jpg",
	"description": "Without telling her family, Elyria takes a one-way flight to New Zealand, abruptly leaving her stable but unfulfilling life in Manhattan. As her husband scrambles to figure out what happened to her, Elyria hurtles into the unknown, testing fate by hitchhiking, tacitly being swept into the lives of strangers, and sleeping in fields, forests, and public parks.Her risky and often surreal encounters with the people and wildlife of New Zealand propel Elyria deeper into her deteriorating mind. Haunted by her sisters death and consumed by an inner violence, her growing rage remains so expertly concealed that those who meet her sense nothing unwell. This discord between her inner and outer reality leads her to another obsession: If her truest self is invisible and unknowable to others, is she even alive? The risks Elyria takes on her journey are paralleled by the risks Catherine Lacey takes on the page. In urgent, spiraling prose she whittles away at the rage within Elyria and exposes the very real, very knowable anxiety of the human condition. And yet somehow Lacey manages to poke fun at her unrelenting self-consciousness, her high-stakes search for the dark heart of the self. In the spirit of Haruki Murakami and Amelia Gray, Nobody Is Ever Missing is full of mordant humor and uncanny insights, as Elyria waffles between obsession and numbness in the face of love, loss, danger, and self-knowledge."
}, {
	"title": "Organic",
	"author": "Various",
	"bookUrl": "images/book-cover-images/organic.png",
	"description": "A few short years ago, Elizabeth Stein could be found in her tiny Manhattan kitchen searching for a way to make gluten-free and vegan products that tasted great and werent overly processed. Working with ingredients such as chia seeds, flax, hemp, and coconut sugar, Elizabeth successfully developed recipes that were all-natural, non-GMO, gluten-free, and diabetes friendly. These recipes helped her form Purely Elizabeth, an award-winning line of products that can be found in more than 1,500 stores."
}, {
	"title": "Red Queen",
	"author": "Victoria Aveyard",
	"bookUrl": "images/book-cover-images/redqueen-1060x1592.jpg",
	"description": "Mare Barrows world is divided by blood—those with common, Red blood serve the Silver-blooded elite, who are gifted with superhuman abilities. Mare is a Red, scraping by as a thief in a poor, rural village, until a twist of fate throws her in front of the Silver court. There, before the king, princes, and all the nobles, she discovers she has an ability of her own. To cover up this impossibility, the king forces her to play the role of a lost Silver princess, and betroths her to one of his own sons. As Mare is drawn further into the Silver world, she risks everything and uses her new position to help the Scarlet Guard—a growing Red rebellion—even as her heart tugs her in an impossible direction. One wrong move can lead to her death, but in the dangerous game she plays the only certainty is betrayal."
}, {
	"title": "Something For The Pain",
	"author": "Paul Austin",
	"bookUrl": "images/book-cover-images/allthebirdssinging-1536x2320.jpg",
	"description": "In this eye-opening account of life in the ER, Paul Austin recalls how the daily grind of long, erratic shifts and endless hordes of patients with sad stories sent him down a path of bitterness and cynicism. Gritty, powerful, and ultimately redemptive, Something for the Pain is a revealing glimpse into the fragility of compassion and sanity in the industrial setting of today’s hospitals."
}, {
	"title": "Spent",
	"author": "Geoffrey Miller",
	"bookUrl": "images/book-cover-images/spent-1536x2366.jpg",
	"description": "Illuminating the hidden reasons for why we buy what we do, Spent applies evolutionary psychology to the sensual wonderland of marketing and perceived status that is American consumer culture. Geoffrey Miller starts with the theory that we purchase things to advertise ourselves to others, and then examines other factors that dictate what we spend money on. With humor and insight, Miller analyzes an array of product choices and deciphers what our decisions say about ourselves, giving us access to a new way of understanding-and improving-our behaviors to become happier consumers."
}, {
	"title": "Tampa",
	"author": "Alissa Nutting",
	"bookUrl": "images/book-cover-images/tampa-1536x2459.jpg",
	"description": "In Alissa Nuttings novel Tampa, Celeste Price, a smoldering 26-year-old middle-school teacher in Florida, unrepentantly recounts her elaborate and sociopathically determined seduction of a 14-year-old student. Celeste has chosen and lured the charmingly modest Jack Patrick into her web. Jack is enthralled and in awe of his eighth-grade teacher, and, most importantly, willing to accept Celeste’s terms for a secret relationship—car rides after dark, rendezvous at Jacks house while his single father works the late shift, and body-slamming erotic encounters in Celestes empty classroom. In slaking her sexual thirst, Celeste Price is remorseless and deviously free of hesitation, a monstress of pure motivation. She deceives everyone, is close to no one, and cares little for anything but her pleasure."
}, {
	"title": "The Disappointment Artist",
	"author": "Jonathan Lethem",
	"bookUrl": "images/book-cover-images/the_disappointment_artist-1536x2334.jpg",
	"description": "In a volume he describes as a series of covert and not-so-covert autobiographical pieces, Jonathan Lethem explores the nature of cultural obsession—from western films and comic books, to the music of Pink Floyd and the New York City subway. Along the way, he shows how each of these voyages out from himself has led him to the source of his beginnings as a writer. The Disappointment Artist is a series of windows onto the collisions of art, landscape, and personal history that formed Lethems richly imaginative, searingly honest perspective on life. A touching, deeply perceptive portrait of a writer in the making."
}, {
	"title": "The Heist",
	"author": "Daryle S.",
	"bookUrl": "images/book-cover-images/the-heist.png",
	"description": "FBI Special Agent Kate OHare is known for her fierce dedication and discipline on the job, chasing down the worlds most wanted criminals and putting them behind bars. Her boss thinks she is tenacious and ambitious; her friends think she is tough, stubborn, and maybe even a bit obsessed. And while Kate has made quite a name for herself for the past five years the only name shes cared about is Nicolas Fox—an international crook she wants in more ways than one."
}, {
	"title": "The Jazz Singer",
	"author": "Miles David",
	"bookUrl": "images/book-cover-images/the-jazz-singer-1536x2451.jpg",
	"description": "The world lost the defiantly unpredictable, trend-busting bop vocalist Anita ODay in November 2006, to dementia and pneumonia. A year or so prior, documentarians Ian McCrudden and Robbie Cavolina (perhaps foreseeing this loss) set out to create the definitive film portrait of the chanteuse, entitled Anita ODay: The Life of a Jazz Singer. This biography recounts ODays life story by intercutting archival performance footage of the vocalist with fond reminiscences from friends and colleagues and cutaways to ODays original reviews and publicity material. Interviewees include Bryant Gumbel, Harry Reasoner, Dick Clark, Annie Ross, and Johnny Mandel."
}, {
	"title": "The Son",
	"author": "Jo Nesbo",
	"bookUrl": "images/book-cover-images/the-son-1536x2290.jpg",
	"description": "Sonny Lofthus is a strangely charismatic and complacent young man. Sonnys been in prison for a dozen years, nearly half his life. The inmates who seek out his uncanny abilities to soothe leave his cell feeling absolved. They dont know or care that Sonny has a serious heroin habit—or where or how he gets his uninterrupted supply of the drug. Or that hes serving time for other peoples crimes."
}, {
	"title": "The Stranger",
	"author": "Albert Camus",
	"bookUrl": "images/book-cover-images/the-stranger.jpg",
	"description": "At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate. This far from civilization they can do anything they want. Anything. But as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far removed from reality as the hope of being rescued."
}, {
	"title": "The Alchemist",
	"author": "Paolo Coelho",
	"bookUrl": "images/book-cover-images/thealchemist-1536x1992.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "The Boy Who Couldn't Sleep And Never Had To",
	"author": "DC Pierson",
	"bookUrl": "images/book-cover-images/theboywhocouldnt-1060x1635.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "The Brief History Of The Dead",
	"author": "Kevin Brockmeier",
	"bookUrl": "images/book-cover-images/thebriefhistoryofthedead.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "The Flame Alphabet",
	"author": "Ben Marcus",
	"bookUrl": "images/book-cover-images/theflamealphabet-1060x1585.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "The Light Between Oceans",
	"author": "M.L. Steadman",
	"bookUrl": "images/book-cover-images/thelightbetweenoceans-1536x2347.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "The Lord Of The Flies",
	"author": "William Goldman",
	"bookUrl": "images/book-cover-images/thelordoftheflies-1536x2309.jpg",
	"description": "Dizzle dang dizzle izzle arcu interdum own yo'. Quisque posuere. Sizzle non ante. Duis fo shizzle stuff, pimpin' fo shizzle, condimentizzle ghetto, yo mamma quizzle, mah nizzle. Cool feugiat. Ut hizzle nizzle leo. Daahng dawg vulputate, pizzle a fo shizzle vulputate, dizzle lacizzle commodo tellizzle, the bizzle eleifend dizzle nulla nizzle metus. Maecenizzle feugizzle nizzle velizzle. Quisque neque mauris, fo shizzle my nizzle break it down, malesuada id, bibendum varizzle, things. Gizzle black, pimpin' black funky fresh hendrerizzle, velit phat owned nisl, ma nizzle tempizzle justo lorizzle sit amet augue."
}, {
	"title": "The Shallows",
	"author": "Nicholas Carr",
	"bookUrl": "images/book-cover-images/theshallows-1536x2332-1.jpg",
	"description": "Is Google making us stupid? When Nicholas Carr posed that question, in a celebrated Atlantic Monthly cover story, he tapped into a well of anxiety about how the Internet is changing us. He also crystallized one of the most important debates of our time: As we enjoy the Nets bounties, are we sacrificing our ability to read and think deeply? Now, Carr expands his argument into the most compelling exploration of the Internets intellectual and cultural consequences yet published. As he describes how human thought has been shaped through the centuries by tools of the mind—from the alphabet to maps, to the printing press, the clock, and the computer—Carr interweaves a fascinating account of recent discoveries in neuroscience by such pioneers as Michael Merzenich and Eric Kandel. Our brains, the historical and scientific evidence reveals, change in response to our experiences. The technologies we use to find, store, and share information can literally reroute our neural pathways."
}, {
	"title": "The Sky Is Everywhere",
	"author": "Jandy Nelson",
	"bookUrl": "images/book-cover-images/theskyiseverywhere-1536x2308.jpg",
	"description": "Adrift after her sister Baileys sudden death, Lennie finds herself torn between quiet, seductive Toby—Baileys boyfriend who shares her grief—and Joe, the new boy in town who bursts with life and musical genius. Each offers Lennie something she desperately needs... though she knows if the two of them collide her whole world will explode. Join Lennie on this heartbreaking and hilarious journey of profound sorrow and mad love, as she makes colossal mistakes and colossal discoveries, as she traipses through band rooms and forest bedrooms and ultimately right into your heart. As much a celebration of love as a poignant portrait of loss, Lennies struggle to sort her own melody out of the noise around her is always honest, often uproarious, and absolutely unforgettable."
}, {
	"title": "The Wealth Of Nations",
	"author": "Adam Smith",
	"bookUrl": "images/book-cover-images/thewealthofthenations-1060x1640.jpg",
	"description": "But, as Andrew Skinner reveals in his introduction to this edition, the real sophistication of The Wealth of Nations lies less in individual areas of economic analysis than in its overall picture of a vast analytical system--a capitalist economy--in which all the parts can be seen simultaneously interacting with each other. In addition, Smiths view of society was not merely an economic one. The Wealth of Nations is far from being an apologia for unregulated business enterprise: Smith was at pains to point out that economic advance can have undesirable social consequences, and that labour which is economically unproductive can be beneficial to society at large."
}, {
	"title": "The Wonderful Wizard Of Oz",
	"author": "L. Frank Baum",
	"bookUrl": "images/book-cover-images/thewonderfulwizard-1536x2381.jpeg",
	"description": "The Wonderful Wizard of Oz, by L. Frank Baum, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras."
}, {
	"title": "To Kill A Mockingbird",
	"author": "Harper Lee",
	"bookUrl": "images/book-cover-images/tokillamockinbird-1536x2435.png",
	"description": "Lawyer Atticus Finch defends the real mockingbird of Harper Lees classic, Puliter Prize-winning novel—a black man charged with the rape of a white woman. Through the eyes of Atticuss children, Scout and Jem Finch, Harper Lee explores with rich humor and unanswering honesty the irrationality of adult attitudes toward race and class in the Deep South of the 1930s."
}, {
	"title": "Tokyo On Foot",
	"author": "Florent Chavouet",
	"bookUrl": "images/book-cover-images/tokyoonfoot-1060x1448.jpg",
	"description": "Florent Chavouet, a young graphic artist, spent six months exploring Tokyo while his girlfriend interned at a company there. Each day he would set forth with a pouch full of color pencils and a sketchpad, and visit different neighborhoods. This stunning book records the city that he got to know during his adventures. It isnt the Tokyo of packaged tours and glossy guidebooks, but a grittier, vibrant place, full of ordinary people going about their daily lives and the scenes and activities that unfold on the streets of a bustling metropolis."
}, {
	"title": "Treasure Island",
	"author": "Robert Louis Stevenson",
	"bookUrl": "images/book-cover-images/treasureisland-1060x1500.jpg",
	"description": "Treasure Island, by Robert Louis Stevenson, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras."
}, {
	"title": "Undiscovered Gyrl",
	"author": "Robert Louis Stevenson",
	"bookUrl": "images/book-cover-images/undiscovered-gyrl-1536x2369.jpg",
	"description": "Beautiful, wild, funny, and lost, Katie Kampenfelt is taking a year off before college to find her passion. Ambitious in her own way, Katie intends to do more than just smoke weed with her boyfriend, Rory, and work at the bookstore. She plans to seduce Dan, a thirty-two-year-old film professor. Katie chronicles her adventures in an anonymous blog, telling strangers her innermost desires, shames, and thrills. But when Dan stops taking her calls, when her alcoholic father suffers a terrible fall, and when she finds herself drawn into a dangerous new relationship, Katies fearless narrative begins to crack, and dark pieces of her past emerge. Sexually frank, often heartbreaking, and bursting with devilish humor, Undiscovered Gyrl is an extraordinarily accomplished novel of identity, voyeurism, and deceit."
}, {
	"title": "White Like Me",
	"author": "Tim Wise",
	"bookUrl": "images/book-cover-images/White_Like_Melarge-1536x2378.jpg",
	"description": "With a new preface and updated chapters, White Like Me is one-part memoir, one-part polemical essay collection. It is a personal examination of the way in which racial privilege shapes the daily lives of white Americans in every realm: employment, education, housing, criminal justice, and elsewhere. Using stories from his own life, Tim Wise demonstrates the ways in which racism not only burdens people of color, but also benefits, in relative terms, those who are white like him. He discusses how racial privilege can harm whites in the long run and make progressive social change less likely. He explores the ways in which whites can challenge their unjust privileges, and explains in clear and convincing language why it is in the best interest of whites themselves to do so. Using anecdotes instead of stale statistics, Wise weaves a narrative that is at once readable and yet scholarly, analytical and yet accessible."
}, {
	"title": "A Novel Of Zelda Fitzgerald",
	"author": "Therese Anne Fowler",
	"bookUrl": "images/book-cover-images/zanovelof-1536x2207.jpg",
	"description": "When beautiful, reckless Southern belle Zelda Sayre meets F. Scott Fitzgerald at a country club dance in 1918, she is seventeen years old and he is a young army lieutenant stationed in Alabama. Before long, the ungettable Zelda has fallen for him despite his unsuitability: Scott isnt wealthy or prominent or even a Southerner, and keeps insisting, absurdly, that his writing will bring him both fortune and fame. Her father is deeply unimpressed. But after Scott sells his first novel, This Side of Paradise, to Scribners, Zelda optimistically boards a train north, to marry him in the vestry of St. Patricks Cathedral and take the rest as it comes."
}]
